Revit 2027 API
PrintSetup Class
Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.PrintSetup
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PrintSetup : APIObject
Public Class PrintSetup
	Inherits APIObject
public ref class PrintSetup : public APIObject
type PrintSetup =
    class
        inherit APIObject
    end
The PrintSetup type exposes the following members.
Properties
Name | Description
CurrentPrintSetting | The current Print Setting of Print Setup.
InSession | The in-session Print Setting of Print Setup.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
Methods
Name | Description
Delete | Delete the current print setting, and make the In-Session setting as the current one.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Rename | Rename the current print setting with the specified name.
Revert | Revert the current print setting.
Save | Save the changes for the current print setting.
SaveAs | Save the current print setting to another print setting with the specified name.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The Print Setup object can only get from PrintManager object.
See Also
Reference
Autodesk.Revit.DB Namespace